In [19]:
import pandas as pd

## Series

In [20]:
data = [1,2,3,4,5]

In [21]:
s = pd.Series(data)

In [22]:
s = pd.Series(data)

In [23]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
index = ['Linha' + str(i) for i in range(5)]

In [25]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [26]:
s = pd.Series(data = data, index = index)

In [27]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [28]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [29]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [30]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [31]:
s1 = s +2

In [32]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [33]:
s2 = s +s1

In [34]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [35]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [36]:
df1 = pd.DataFrame(data = data)

In [37]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
index = ['Linha' + str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [39]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [40]:
columns = ['Coluna' + str(i) for i in range(3)]
columns

['coluna0', 'coluna1', 'coluna2']

In [41]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [44]:
data = {
    'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
    'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
    'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}
}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [45]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [46]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [47]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        coluna0  coluna1  coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [48]:
df1[df1 > 0] = 'A'
df1

       coluna0 coluna1 coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [49]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [50]:
df3[df3 > 0] = 'C'
df3

       coluna0 coluna1 coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [51]:
df4 = pd.concat([df1, df2, df3])
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A     NaN     NaN     NaN
Linha1       A       A       A     NaN     NaN     NaN
Linha2       A       A       A     NaN     NaN     NaN
Linha0     NaN     NaN     NaN       B       B       B
Linha1     NaN     NaN     NaN       B       B       B
Linha2     NaN     NaN     NaN       B       B       B
Linha0       C       C       C     NaN     NaN     NaN
Linha1       C       C       C     NaN     NaN     NaN
Linha2       C       C       C     NaN     NaN     NaN

In [52]:
df4 = pd.concat([df1, df2, df3])
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A     NaN     NaN     NaN
Linha1       A       A       A     NaN     NaN     NaN
Linha2       A       A       A     NaN     NaN     NaN
Linha0     NaN     NaN     NaN       B       B       B
Linha1     NaN     NaN     NaN       B       B       B
Linha2     NaN     NaN     NaN       B       B       B
Linha0       C       C       C     NaN     NaN     NaN
Linha1       C       C       C     NaN     NaN     NaN
Linha2       C       C       C     NaN     NaN     NaN

In [53]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

       coluna0 coluna1 coluna2 Coluna0 Coluna1 Coluna2 coluna0 coluna1 coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

In [56]:

df1 = pd.DataFrame({'A': {'X': 1}, 'B': {'X': 2}})
df2 = pd.DataFrame({'C': {'X': 3}, 'D': {'X': 4}})
pd.concat([df1, df2])

     A    B    C    D
X  1.0  2.0  NaN  NaN
X  NaN  NaN  3.0  4.0

In [57]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [58]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [59]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4